In [59]:
import pandas as pd

In [60]:
df = pd.read_csv("restaurant.csv")

In [61]:
#df.to_excel("restaurant.xlsx")

In [62]:
df.shape

(10417, 10)

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10417 entries, 0 to 10416
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   10417 non-null  int64
 1   review_id    10417 non-null  object
 2   user_id      10417 non-null  object
 3   business_id  10417 non-null  object
 4   stars        10417 non-null  int64
 5   useful       10417 non-null  int64
 6   funny        10417 non-null  int64
 7   cool         10417 non-null  int64
 8   text         10417 non-null  object
 9   date         10417 non-null  object
dtypes: int64(5), object(5)
memory usage: 814.0+ KB

In [64]:
df["user_id"].value_counts()

user_id
otT6RSZdIuYjS9vKR4r-tA    5
8vUe6yBzKD-GsejC9tCrGA    5
EipwmwToR90iinI5aCQoxQ    4
J18ol0RI1TuyqGKFZJfh3w    3
ENtSjbekFHjltp2TFkstHg    3
                         ..
L5_8oviH2I6ltKqH517unA    1
Y8tEMLFqm1d0se6-sQgJeQ    1
uBSluCK4jkFqebkqM2rGdA    1
sjHzODLt7FKi1hvjkYalBA    1
GsALS1y9wJoBRJTEzJiISg    1
Name: count, Length: 10129, dtype: int64

In [65]:
df.head()

,Unnamed: 0,review_id,user_id,business_id,stars,useful,funny,cool,text,date
0,2370338,_WTGv5XnA-qb_XD1D7Z0jg,6PgdGb3HrZdsfl2GiULo8w,RESDUcs7fIiihp38-d6_6g,5,0,1,0,After getting food poisoning at the Palms hote...,2012-12-04 03:10:18
1,2370357,JlNnsvMPLK_1-X2hwzK24w,IS9yw8P2uAPBX6FNLLX4KA,RESDUcs7fIiihp38-d6_6g,4,39,21,29,"""A feast worthy of Gods""\n\nBaccarnal Buffet i...",2014-01-17 00:50:50
2,2370373,hBkoWffORRb6aqKhC_Li2A,uZdFsE_aHbFBChgN6Xa8tw,RESDUcs7fIiihp38-d6_6g,4,1,1,1,The crab legs are better than the ones at Wick...,2015-06-08 18:03:09
3,2370411,rbkxvrgZg5kdCL2a66QYmA,8ZWJNAEWsymXDzKx3B0tTQ,RESDUcs7fIiihp38-d6_6g,1,0,0,0,Not worth it! Too salty food and expensive! Th...,2016-12-19 16:15:29
4,2370500,5tw_pedoHVi9bgeiBNsISg,E0sm4Ve7ifanFYeQMcV8Eg,RESDUcs7fIiihp38-d6_6g,5,0,0,0,I would give this infinite stars if I could. M...,2015-07-28 07:13:17

In [66]:
df["user_id"].nunique()

10129

In [67]:
#drop Unnamed: 0	, review_id, business_id columns from df

df.drop(columns=["Unnamed: 0", "review_id", "business_id","user_id"], inplace=True)
df.isnull().sum()

stars     0
useful    0
funny     0
cool      0
text      0
date      0
dtype: int64

In [68]:
df.head()

,stars,useful,funny,cool,text,date
0,5,0,1,0,After getting food poisoning at the Palms hote...,2012-12-04 03:10:18
1,4,39,21,29,"""A feast worthy of Gods""\n\nBaccarnal Buffet i...",2014-01-17 00:50:50
2,4,1,1,1,The crab legs are better than the ones at Wick...,2015-06-08 18:03:09
3,1,0,0,0,Not worth it! Too salty food and expensive! Th...,2016-12-19 16:15:29
4,5,0,0,0,I would give this infinite stars if I could. M...,2015-07-28 07:13:17

In [70]:
#create 3 columns that year and month and day and hour from date column and drop date column

df["year"] = pd.to_datetime(df["date"]).dt.year
df["month"] = pd.to_datetime(df["date"]).dt.month
df["day"] = pd.to_datetime(df["date"]).dt.day
df["hour"] = pd.to_datetime(df["date"]).dt.hour
df.drop(columns=["date"], inplace=True)

In [73]:
df.head()

,stars,useful,funny,cool,text,year,month,day,hour
0,5,0,1,0,After getting food poisoning at the Palms hote...,2012,12,4,3
1,4,39,21,29,"""A feast worthy of Gods""\n\nBaccarnal Buffet i...",2014,1,17,0
2,4,1,1,1,The crab legs are better than the ones at Wick...,2015,6,8,18
3,1,0,0,0,Not worth it! Too salty food and expensive! Th...,2016,12,19,16
4,5,0,0,0,I would give this infinite stars if I could. M...,2015,7,28,7